app/views/users/show.html.erb

					  <tbody>
						<% if @user.events.empty? %>
---
SELECT "events".* FROM "events" INNER JOIN "events_users" ON "events"."id" = "events_users"."event_id" WHERE "events_users"."user_id" = 1

	<br />
	<% if @user.messages.empty? %>
---
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = 7