app/views/events/show.html.erb

	<table>
		<% @event.users.sort_by {|h| [h["last_name"],h["first_name"]]}.each do |user| %>
---
SELECT 1 FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = 3 AND "users"."id" = 7 LIMIT 1