app/controllers/events_controller.rb

SELECT 1 FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = 2 AND "users"."id" = 7 LIMIT 1
---
	def sign_up
		@event = Event.find(params[:event])
		@user = User.find(params[:user])
		unless @event.users.include?(@user)