app/controllers/events_controller.rb

  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("address", "city", "created_at", "date", "state", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "events" SET "location" = '540 Sharf St, New Washington OH', "updated_at" = '2013-11-21 07:37:32.977962' WHERE "events"."id" = 2

	def sign_up
		@event = Event.find(params[:event_id])
		@user = User.find(params[:user_id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 7]]

	def unenroll
		@event = Event.find(params[:event_id])
		@user = User.find(params[:user_id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 7]]