app/controllers/messages_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "7"]]
INSERT INTO "messages" ("author", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
	def create
		@user = User.find(params[:user_id])
		@message = @user.messages.build(params[:message])
		if @message.save