app/controllers/users_controller.rb

	def register_process
		@user = User.new(params[:user])
		if @user.save
---
INSERT INTO "users" ("birthdate", "created_at", "first_name", "last_name", "password", "rank", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)