app/controllers/users_controller.rb

	def register
		@user = User.new(params[:user])
		if @user.save
---
INSERT INTO "users" ("birthdate", "created_at", "first_name", "last_name", "password", "rank", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	def login
		@user = User.find_by_username(params[:user][:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'jrod' LIMIT 1