app/views/public/index.html.erb

	<td class="cell"><%= event.date.to_s(:time) %></td>
	<td class="cell-right"><%= event.users.count %></td>
---
SELECT COUNT(*) FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = 1